
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Номен, Цена)
	// Вставити вміст обробника.
	а = Номен; // Вносим в переменную название номенклатуры, которое передали в процедуру
	Цена = а.Цена; // Подтягиваем цена связанную с этой номенклатурой
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Номен = Элементы.Товары.ТекущиеДанные.Номенклатура; // Вносим в переменную текущее значение номенклатуры
	Цена = 0;                                           // Обнуляем цену, чтоб не передавать НУЛЛ
	ТоварыНоменклатураПриИзмененииНаСервере(Номен, Цена); // Вызываем процедуру на сервере
	Элементы.Товары.ТекущиеДанные.Цена = Цена;            // Вносим цену в табличную часть
	ТоварыЦенаПриИзменении(Элемент);                      // Вызываем процедуру пересчета
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьСумму(Элементы.Товары.ТекущиеДанные); // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьСумму(Элементы.Товары.ТекущиеДанные); // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьЦену(Элементы.Товары.ТекущиеДанные);  // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") // Перенос Итога по полю "Сумма" в "СуммуДокумента"
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") // При Окончании редактирования табличной части изменяем реквизит документа "Сумма Документа"
КонецПроцедуры
