
Процедура ДатаЗапретаРедактированияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставити вміст обробника.
	
	Запрос =  Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДатаЗапретаРедактирования.Право КАК Право,
	               |	ДатаЗапретаРедактирования.ДатаЗапрета КАК ДатаЗапрета
	               |ИЗ
	               |	РегистрСведений.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗапрета";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из ТЗ цикл
		Если РольДоступна(стр.Право) тогда
			Если Источник.Дата < стр.ДатаЗапрета тогда
				Сообщить("ПЛОХАЯ ДАТА!");
				Отказ = Истина;
				Возврат;
			Иначе
				Сообщить("Дата редактирования - разрешено!");
				Прервать;
			КонецЕсли;
			
		конецесли;
	Конеццикла;
	
		
	
КонецПроцедуры
