
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Отбор, Цена)
					// Вставити вміст обробника.
	//а = Номен; 		// Вносим в переменную название номенклатуры, которое передали в процедуру
	//Цена = а.Цена; 	// Подтягиваем цена связанную с этой номенклатурой
	
	Данные = РегистрыСведений.ЦеныТоваров.СрезПоследних(Объект.Дата - 1, Отбор);
	Если Данные.Количество()=0 тогда
		Возврат;
	Конецесли;
	Цена = Данные[0].Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Номен = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипЦены", Объект.ТипЦены);
	Отбор.Вставить("Номенклатура", Номен);
	
	
															// Вносим в переменную текущее значение номенклатуры
	Цена = 0;                                          		 // Обнуляем цену, чтоб не передавать НУЛЛ
	ТоварыНоменклатураПриИзмененииНаСервере(Отбор, Цена);	// Вызываем процедуру на сервере
	Элементы.Товары.ТекущиеДанные.Цена = Цена;            	// Вносим цену в табличную часть
	ТоварыЦенаПриИзменении(Элемент);                      	// Вызываем процедуру пересчета
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьСумму(Элементы.Товары.ТекущиеДанные); // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьСумму(Элементы.Товары.ТекущиеДанные); // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьЦену(Элементы.Товары.ТекущиеДанные);  // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") // Перенос Итога по полю "Сумма" в "СуммуДокумента"
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") // При Окончании редактирования табличной части изменяем реквизит документа "Сумма Документа"
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	// Вставити вміст обробника.
	МоиКурс = МодульВалютногоУчета.ПолучитьКурсВалют(Объект.Валюта, Объект.Дата);
		Объект.КурсВзаиморасчетов = МоиКурс.Курс;
		Объект.КратностьВзаиморасчетов = МоиКурс.Кратность;
	

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныПриИзменении(Элемент)
	Для каждого стр из Объект.Товары цикл
		//Номен = Элементы.Товары.ТекущиеДанные.Номенклатура;
		Отбор = Новый Структура;
		Отбор.Вставить("ТипЦены", Объект.ТипЦены);
		Отбор.Вставить("Номенклатура", стр.Номенклатура);
														// Вносим в переменную текущее значение номенклатуры
		Цена = 0;                                          		 // Обнуляем цену, чтоб не передавать НУЛЛ
		ТоварыНоменклатураПриИзмененииНаСервере(Отбор, Цена);	// Вызываем процедуру на сервере
		стр.Цена = Цена;
		ОбработкаТабличныхЧастей.ПересчитатьСумму(стр);
		
	конеццикла;
КонецПроцедуры
